RouNNdeL/esp8266-leds/src/main.cpp
#include <Arduino.h>
#include <WiFiManager.h>
#include <ESP8266WebServer.h>
#include <Adafruit_NeoPixel.h>
#include <EEPROM.h>
#include <WiFiUdp.h>
#include <ESP8266httpUpdate.h>
#include <ArduinoOTA.h>

extern "C" {
#include "user_interface.h"
#include "color_utils.h"
}

#include "config.h"
#include "memory.h"

Adafruit_NeoPixel strip = Adafruit_NeoPixel(LED_COUNT, LED_PIN, NEO_GRB + NEO_KHZ800);
ESP8266WebServer server(80);

#define FLAG_NEW_FRAME (1 << 0)
#define FLAG_PROFILE_UPDATED (1 << 1)
#define FLAG_TRANSITION (1 << 2)

os_timer_t frameTimer;
volatile uint32_t frame;
volatile uint8_t flags;

led_count_t virtual_devices[DEVICE_COUNT] = VIRTUAL_DEVICES;

global_settings globals;
#define increment_profile() globals.n_profile = (globals.n_profile+1)%globals.profile_count

/* The first 3 bytes are the current color, the last 3 bytes are the old color to transition from */
uint8_t color_converted[6 * DEVICE_COUNT] = {};
volatile transition_t transition_frame;
String requestId = "";

#define refresh_profile() load_profile(&current_profile, globals.profile_order[globals.n_profile]); \
convert_all_frames()

profile current_profile;
uint16_t frames[DEVICE_COUNT][TIME_COUNT];
uint32_t auto_increment;

uint16_t time_to_frames(uint8_t time)
{
    if(time <= 80)
    {
        return time * FPS / 16;
    }
    if(time <= 120)
    {
        return time * FPS / 8 - 5 * FPS;
    }
    if(time <= 160)
    {
        return time * FPS / 2 - 50 * FPS;
    }
    if(time <= 190)
    {
        return (time - 130) * FPS;
    }
    if(time <= 235)
    {
        return (2 * time - 320) * FPS;
    }
    if(time <= 245)
    {
        return (15 * time - 3375) * FPS;
    }
    return (60 * time - 14400) * FPS;
}

void convert_to_frames(uint16_t *frames, uint8_t *times)
{
    for(uint8_t i = 0; i < TIME_COUNT; ++i)
    {
        frames[i] = time_to_frames(times[i]);
    }
}

void convert_all_frames()
{
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        convert_to_frames(frames[i], current_profile.devices[i].timing);
    }
}

uint32_t autoincrement_to_frames(uint8_t time)
{
    if(time <= 60)
    {
        return time * FPS / 2;
    }
    if(time <= 90)
    {
        return (time - 30) * FPS;
    }
    if(time <= 126)
    {
        return (5 * time / 2 - 165) * FPS;
    }
    if(time <= 156)
    {
        return (5 * time - 480) * FPS;
    }
    if(time <= 196)
    {
        return (15 * time - 2040) * FPS;
    }
    if(time <= 211)
    {
        return (60 * time - 10860) * FPS;
    }
    if(time <= 253)
    {
        return (300 * time - 61500) * FPS;
    }
    if(time == 254) return 18000 * FPS;
    return 21600 * FPS;
}

void convert_color()
{
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        uint8_t index = i * 6;
        /* Copy the now old color to its place (3 bytes after the new) */
        memcpy(color_converted + index + 3, color_converted + index, 3);
        set_color_manual(color_converted, color_brightness(
                (globals.flags[i] & GLOBALS_FLAG_ENABLED) ? globals.brightness[i] : 0,
                color_from_buf(globals.color + index)
        ));
    }

    transition_frame = 0;
    flags |= FLAG_TRANSITION;
}

void timerCallback(void *pArg)
{
    flags |= FLAG_NEW_FRAME;
    frame++;
    if(flags & FLAG_TRANSITION) transition_frame++;
}

void user_init()
{
    os_timer_setfn(&frameTimer, timerCallback, NULL);
    os_timer_arm(&frameTimer, 10, true);
}

void eeprom_init()
{
    EEPROM.begin(SPI_FLASH_SEC_SIZE);
    load_globals(&globals);
    auto_increment = autoincrement_to_frames(globals.auto_increment);
    refresh_profile();
    convert_color();
}

uint8_t char2int(char input)
{
    if(input >= '0' && input <= '9')
        return input - '0';
    if(input >= 'A' && input <= 'F')
        return input + 10 - 'A';
    if(input >= 'a' && input <= 'f')
        return input + 10 - 'a';
    return 0;
}

void setStripStatus(uint8_t r, uint8_t g, uint8_t b)
{
    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        if(!(globals.flags[i] & GLOBALS_FLAG_STATUSES))
            return;
        strip.setBrightness(UINT8_MAX);
        for(led_count_t j = 0; j < virtual_devices[i]; ++j)
        {
            if(j % 4)
                strip.setPixelColor(j, color_brightness(12, r, g, b));
            else
                strip.setPixelColor(j, r, g, b);
        }
        strip.show();
    }
}

int checkUpdate()
{
    int code;
    uint8_t tries = 0;
    do
    {
        tries++;
        HTTPClient http;
        http.begin(HTTP_UPDATE_HOST, HTTP_UPDATE_PORT, String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID,
                   HTTP_UPDATE_HTTPS_FINGERPRINT);
        http.useHTTP10(true);
        http.setTimeout(2500);
        http.setUserAgent(F("ESP8266-http-Update"));
        http.addHeader(F("x-Request-Attempts"), String(tries));
        http.addHeader(F("x-ESP8266-STA-MAC"), WiFi.macAddress());
        http.addHeader(F("x-ESP8266-AP-MAC"), WiFi.softAPmacAddress());
        http.addHeader(F("x-ESP8266-free-space"), String(ESP.getFreeSketchSpace()));
        http.addHeader(F("x-ESP8266-sketch-size"), String(ESP.getSketchSize()));
        http.addHeader(F("x-ESP8266-sketch-md5"), String(ESP.getSketchMD5()));
        http.addHeader(F("x-ESP8266-chip-size"), String(ESP.getFlashChipRealSize()));
        http.addHeader(F("x-ESP8266-sdk-version"), ESP.getSdkVersion());
        http.addHeader(F("x-ESP8266-mode"), F("check"));
        http.addHeader(F("x-ESP8266-version"), String(VERSION_CODE));

        code = http.GET();
        http.end();
    }
    while((code == -1 || code == -11) && tries < REQUEST_RETIRES);
    return code;
}

HTTPUpdateResult update(uint8_t reboot)
{
    setStripStatus(COLOR_MAGENTA);
#if SERIAL_DEBUG
    Serial.println("[OTA] Checking for updates...");
#endif /* SERIAL_DEBUG */
    ESPhttpUpdate.rebootOnUpdate(false);
#if HTTP_UPDATE_HTTPS
    HTTPUpdateResult ret = ESPhttpUpdate.update(HTTP_UPDATE_HOST, HTTP_UPDATE_PORT,
                                                String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID,
                                                String(VERSION_CODE), HTTP_UPDATE_HTTPS_FINGERPRINT);
#else
    HTTPUpdateResult ret = ESPhttpUpdate.update(HTTP_UPDATE_HOST, HTTP_UPDATE_PORT,
                                                String(HTTP_UPDATE_URL) + "?device_id=" + DEVICE_ID,
                                                String(VERSION_CODE));
#endif /* HTTP_UPDATE_HTTPS */
    switch(ret)
    {
        case HTTP_UPDATE_FAILED:
#if SERIAL_DEBUG
            Serial.println("[OTA] Update failed");
#endif /* SERIAL_DEBUG */
            setStripStatus(COLOR_RED);
            yield();
            delay(1000);
            break;
        case HTTP_UPDATE_NO_UPDATES:
#if SERIAL_DEBUG
            Serial.println("[OTA] No update");
#endif
            setStripStatus(rgb(244, 165, 0));
            yield();
            delay(1000);
            break;
        case HTTP_UPDATE_OK:
#if SERIAL_DEBUG
            Serial.println("[OTA] Update successful"); // may not called we reboot the ESP
#endif /* SERIAL_DEBUG */
            setStripStatus(COLOR_GREEN);
            yield();
            delay(1000);
            if(reboot)
            {
#if SERIAL_DEBUG
                Serial.println("[OTA] Rebooting...");
#endif /* SERIAL_DEBUG */
                delay(250);
                ESP.restart();
            }
            break;
    }
    return ret;
}

