RouNNdeL/esp8266-leds/src/main.cpp
void ICACHE_FLASH_ATTR restart()
{
    server.send(200, "text/html",
                "<p>Your device is restarting...</p><p><a href=\"/\">Go back to configuration panel</a></p>");
    delay(500);
    ESP.restart();
}

void ICACHE_FLASH_ATTR send_json()
{
    server.send(200, "application/json", getDeviceJson());
}

void ICACHE_FLASH_ATTR manual_update_check()
{
    auto code = checkUpdate();
    String statusString;
    switch(code)
    {
        case HTTP_CODE_NO_CONTENT:
            statusString = "Update found, click <a href=\"/apply_update\">here</a> to download and apply the update";
            break;
        case HTTP_CODE_NOT_MODIFIED:
            statusString = "No updates found, <a href=\"/\">return to the main page<a/>";
            break;
        default:
            statusString = "Update check failed: HTTP " + code;
            break;
    }
    server.send(200, "text/html", statusString);
}

void ICACHE_FLASH_ATTR apply_update()
{
    server.send(200, "text/html",
                "<p>The device will now download the update and restart to apply the changes</p><p><a href=\"/\">Main page</a></p>");
    delay(500);
    update(1);
}

void on_disconnected(const WiFiEventStationModeDisconnected &event)
{
    ESP.restart();
}

void configModeCallback(WiFiManager *myWiFiManager)
{
    setStripStatus(COLOR_CYAN);
}

void recover()
{
    EEPROM.begin(SPI_FLASH_SEC_SIZE);

    for(uint8_t i = 0; i < DEVICE_COUNT; ++i)
    {
        globals.brightness[i] = 0xff;
        globals.flags[i] = GLOBALS_FLAG_ENABLED | GLOBALS_FLAG_STATUSES;

        current_profile.devices[i].effect = PIECES;
        current_profile.devices[i].color_count = 2;
        current_profile.devices[i].color_cycles = 1;
        current_profile.devices[i].timing[TIME_OFF] = 0;
        current_profile.devices[i].timing[TIME_FADEIN] = 0;
        current_profile.devices[i].timing[TIME_ON] = 60;
        current_profile.devices[i].timing[TIME_FADEOUT] = 30;
        current_profile.devices[i].timing[TIME_ROTATION] = 90;
        current_profile.devices[i].timing[TIME_DELAY] = 0;
        current_profile.devices[i].args[ARG_BIT_PACK] = DIRECTION | SMOOTH;
        current_profile.devices[i].args[ARG_PIECES_PIECE_COUNT] = 6;
        current_profile.devices[i].args[ARG_PIECES_COLOR_COUNT] = 2;
        set_color_manual(current_profile.devices[i].colors, grb(COLOR_RED));
        set_color_manual(current_profile.devices[i].colors + 3, grb(COLOR_BLUE));
    }

    globals.auto_increment = 0;
    globals.profile_order[0] = 0;
    globals.profile_count = 1;
    globals.n_profile = 0;

    convert_all_frames();

    save_globals(&globals);
    save_profile(&current_profile, 0);
}

void setup()
{
#if SERIAL_DEBUG
    Serial.begin(115200);

    Serial.println("");
    Serial.println("|---------------------------|");
    Serial.println("|------ Begin Startup ------|");
    Serial.println("| LED Controller by RouNdeL |");
    Serial.println("|---------------------------|");

    Serial.println("Version Name: " + String(VERSION_NAME));
    Serial.println("Version Code: " + String(VERSION_CODE));
    Serial.println("Build Date: " + BUILD_DATE);
    Serial.println("Device Id: " + String(DEVICE_ID));
#endif /* SERIAL_DEBUG */

#if RECOVER
    recover();
#else
    eeprom_init();
#endif /* RECOVER */

    strip.begin();
    setStripStatus(COLOR_RED);

    WiFiManager manager;
#if !SERIAL_DEBUG
    manager.setDebugOutput(0);
#endif /* SERIAL_DEBUG */
    manager.setAPCallback(configModeCallback);
    manager.setAPStaticIPConfig(IPAddress(192, 168, 1, 1), IPAddress(192, 168, 1, 1), IPAddress(255, 255, 255, 0));
    manager.setConfigPortalTimeout(300);
    manager.autoConnect(AP_NAME);

    if(checkUpdate() == HTTP_CODE_OK) update(1);

#if SERIAL_DEBUG
    Serial.println("|---------------------------|");
    Serial.println("|------- Start LEDs --------|");
    Serial.println("|---------------------------|");
#endif /* SERIAL_DEBUG */

#if PAGE_DEBUG
    server.on("/debug", debug_info);
#endif /* PAGE_DEBUG */

    WiFi.onStationModeDisconnected(on_disconnected);

    server.on("/", handle_root);
    server.on("/restart", restart);
    server.on("/config", redirect_to_config);
    server.on("/globals", receive_globals);
    server.on("/profile", receive_profile);
    server.on("/api", send_json);
    server.on("/update", manual_update_check);
    server.on("/apply_update", apply_update);

    const char *headers[] = {"x-Request-Id"};
    size_t headers_size = sizeof(headers) / sizeof(char *);
    server.collectHeaders(headers, headers_size);

    server.begin();
    ArduinoOTA.begin();

    user_init();
}

void loop()
{
    /* We do not want the transition to lag, so we don't handle the client */
    if(!(flags & FLAG_TRANSITION))
    {
        server.handleClient();
    }

    ArduinoOTA.handle();

    if(flags & FLAG_NEW_FRAME)
    {
        flags &= ~FLAG_NEW_FRAME;
        uint8 enabled = 0;

        uint16_t virtual_led_offset = 0;
        for(uint8_t d = 0; d < DEVICE_COUNT; ++d)
        {
            uint8_t *p = strip.getPixels() + virtual_led_offset * 3;
            if(globals.flags[d] & GLOBALS_FLAG_ENABLED | flags & FLAG_TRANSITION)
            {
                enabled = 1;
                if(globals.flags[d] & GLOBALS_FLAG_EFFECTS)
                {

                    device_profile &device = current_profile.devices[d];
                    digital_effect((effect) device.effect, p, virtual_devices[d], 0, frame + frames[d][TIME_DELAY],
                                   frames[d], device.args, device.colors, device.color_count, device.color_cycles);


                    for(uint8_t i = 0; i < virtual_devices[d]; ++i)
                    {
                        uint8_t index = i * 3;
                        set_color_manual(p + index, color_brightness(globals.brightness[d], color_from_buf(p + index)));
                        p[index] = actual_brightness(p[index]);
                        p[index + 1] = actual_brightness(p[index + 1]);
                        p[index + 2] = actual_brightness(p[index + 2]);
                    }

                    strip.show();
                }
                else
                {
                    uint8_t index = d * 6;
                    uint8_t color[3];
                    cross_fade(color, color_converted + index, 3, 0, transition_frame * UINT8_MAX / TRANSITION_FRAMES);
                    color[index] = actual_brightness(color[index]);
                    color[index + 1] = actual_brightness(color[index + 1]);
                    color[index + 2] = actual_brightness(color[index + 2]);
                    for(led_count_t i = 0; i < virtual_devices[d]; ++i)
                    {
                        set_color_manual(p + i * 3, grb(color_from_buf(color)));
                    }
                    strip.show();

                    if(transition_frame >= TRANSITION_FRAMES && flags & FLAG_TRANSITION)
                    {
                        memcpy(color_converted + index + 3, color_converted + index, 3);
                        flags &= ~FLAG_TRANSITION;
                        sendDeviceState();
                    }
                }
            }
            else
            {
                for(led_count_t i = 0; i < LED_COUNT; ++i)
                {
                    set_color_manual(p + i * 3, grb(COLOR_BLACK));
                }
                strip.show();
            }

            virtual_led_offset += virtual_devices[d];
        }

        if(auto_increment && frame && frame % auto_increment == 0 && enabled && globals.profile_count > 1)
        {
            if(flags & FLAG_PROFILE_UPDATED)
            {
                save_profile(&current_profile, globals.profile_order[globals.n_profile]);
                flags &= ~FLAG_PROFILE_UPDATED;
            }
            increment_profile();
            refresh_profile();
            frame = 0;
        }
    }
}
